mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xk/common/mb9bf36xk.h
#define FM_INTREQ_IRQ021MON_AVAILABLE             1
#define FM4_INTREQ_IRQ022MON_AVAILABLE            1
#define FM_INTREQ_IRQ022MON_AVAILABLE             1
#define FM4_INTREQ_IRQ023MON_AVAILABLE            1
#define FM_INTREQ_IRQ023MON_AVAILABLE             1
#define FM4_INTREQ_IRQ024MON_AVAILABLE            1
#define FM_INTREQ_IRQ024MON_AVAILABLE             1
#define FM4_INTREQ_IRQ025MON_AVAILABLE            1
#define FM_INTREQ_IRQ025MON_AVAILABLE             1
#define FM4_INTREQ_IRQ026MON_AVAILABLE            1
#define FM_INTREQ_IRQ026MON_AVAILABLE             1
#define FM4_INTREQ_IRQ027MON_AVAILABLE            1
#define FM_INTREQ_IRQ027MON_AVAILABLE             1
#define FM4_INTREQ_IRQ028MON_AVAILABLE            1
#define FM_INTREQ_IRQ028MON_AVAILABLE             1
#define FM4_INTREQ_IRQ029MON_AVAILABLE            1
#define FM_INTREQ_IRQ029MON_AVAILABLE             1
#define FM4_INTREQ_IRQ030MON_AVAILABLE            1
#define FM_INTREQ_IRQ030MON_AVAILABLE             1
#define FM4_INTREQ_IRQ031MON_AVAILABLE            1
#define FM_INTREQ_IRQ031MON_AVAILABLE             1
#define FM4_INTREQ_IRQ032MON_AVAILABLE            1
#define FM_INTREQ_IRQ032MON_AVAILABLE             1
#define FM4_INTREQ_IRQ033MON_AVAILABLE            1
#define FM_INTREQ_IRQ033MON_AVAILABLE             1
#define FM4_INTREQ_IRQ034MON_AVAILABLE            1
#define FM_INTREQ_IRQ034MON_AVAILABLE             1
#define FM4_INTREQ_IRQ035MON_AVAILABLE            1
#define FM_INTREQ_IRQ035MON_AVAILABLE             1
#define FM4_INTREQ_IRQ036MON_AVAILABLE            1
#define FM_INTREQ_IRQ036MON_AVAILABLE             1
#define FM4_INTREQ_IRQ037MON_AVAILABLE            1
#define FM_INTREQ_IRQ037MON_AVAILABLE             1
#define FM4_INTREQ_IRQ038MON_AVAILABLE            1
#define FM_INTREQ_IRQ038MON_AVAILABLE             1
#define FM4_INTREQ_IRQ039MON_AVAILABLE            1
#define FM_INTREQ_IRQ039MON_AVAILABLE             1
#define FM4_INTREQ_IRQ040MON_AVAILABLE            1
#define FM_INTREQ_IRQ040MON_AVAILABLE             1
#define FM4_INTREQ_IRQ041MON_AVAILABLE            1
#define FM_INTREQ_IRQ041MON_AVAILABLE             1
#define FM4_INTREQ_IRQ042MON_AVAILABLE            1
#define FM_INTREQ_IRQ042MON_AVAILABLE             1
#define FM4_INTREQ_IRQ043MON_AVAILABLE            1
#define FM_INTREQ_IRQ043MON_AVAILABLE             1
#define FM4_INTREQ_IRQ044MON_AVAILABLE            1
#define FM_INTREQ_IRQ044MON_AVAILABLE             1
#define FM4_INTREQ_IRQ045MON_AVAILABLE            1
#define FM_INTREQ_IRQ045MON_AVAILABLE             1
#define FM4_INTREQ_IRQ046MON_AVAILABLE            1
#define FM_INTREQ_IRQ046MON_AVAILABLE             1
#define FM4_INTREQ_IRQ047MON_AVAILABLE            1
#define FM_INTREQ_IRQ047MON_AVAILABLE             1
#define FM4_INTREQ_IRQ048MON_AVAILABLE            1
#define FM_INTREQ_IRQ048MON_AVAILABLE             1
#define FM4_INTREQ_IRQ049MON_AVAILABLE            1
#define FM_INTREQ_IRQ049MON_AVAILABLE             1
#define FM4_INTREQ_IRQ050MON_AVAILABLE            1
#define FM_INTREQ_IRQ050MON_AVAILABLE             1
#define FM4_INTREQ_IRQ051MON_AVAILABLE            1
#define FM_INTREQ_IRQ051MON_AVAILABLE             1
#define FM4_INTREQ_IRQ052MON_AVAILABLE            1
#define FM_INTREQ_IRQ052MON_AVAILABLE             1
#define FM4_INTREQ_IRQ053MON_AVAILABLE            1
#define FM_INTREQ_IRQ053MON_AVAILABLE             1
#define FM4_INTREQ_IRQ054MON_AVAILABLE            1
#define FM_INTREQ_IRQ054MON_AVAILABLE             1
#define FM4_INTREQ_IRQ055MON_AVAILABLE            1
#define FM_INTREQ_IRQ055MON_AVAILABLE             1
#define FM4_INTREQ_IRQ056MON_AVAILABLE            1
#define FM_INTREQ_IRQ056MON_AVAILABLE             1
#define FM4_INTREQ_IRQ057MON_AVAILABLE            1
#define FM_INTREQ_IRQ057MON_AVAILABLE             1
#define FM4_INTREQ_IRQ058MON_AVAILABLE            1
#define FM_INTREQ_IRQ058MON_AVAILABLE             1
#define FM4_INTREQ_IRQ059MON_AVAILABLE            1
#define FM_INTREQ_IRQ059MON_AVAILABLE             1
#define FM4_INTREQ_IRQ060MON_AVAILABLE            1
#define FM_INTREQ_IRQ060MON_AVAILABLE             1
#define FM4_INTREQ_IRQ061MON_AVAILABLE            1
#define FM_INTREQ_IRQ061MON_AVAILABLE             1
#define FM4_INTREQ_IRQ062MON_AVAILABLE            1
#define FM_INTREQ_IRQ062MON_AVAILABLE             1
#define FM4_INTREQ_IRQ063MON_AVAILABLE            1
#define FM_INTREQ_IRQ063MON_AVAILABLE             1
#define FM4_INTREQ_IRQ064MON_AVAILABLE            1
#define FM_INTREQ_IRQ064MON_AVAILABLE             1
#define FM4_INTREQ_IRQ065MON_AVAILABLE            1
#define FM_INTREQ_IRQ065MON_AVAILABLE             1
#define FM4_INTREQ_IRQ066MON_AVAILABLE            1
#define FM_INTREQ_IRQ066MON_AVAILABLE             1
#define FM4_INTREQ_IRQ067MON_AVAILABLE            1
#define FM_INTREQ_IRQ067MON_AVAILABLE             1
#define FM4_INTREQ_IRQ068MON_AVAILABLE            1
#define FM_INTREQ_IRQ068MON_AVAILABLE             1
#define FM4_INTREQ_IRQ069MON_AVAILABLE            1
#define FM_INTREQ_IRQ069MON_AVAILABLE             1
#define FM4_INTREQ_IRQ070MON_AVAILABLE            1
#define FM_INTREQ_IRQ070MON_AVAILABLE             1
#define FM4_INTREQ_IRQ071MON_AVAILABLE            1
#define FM_INTREQ_IRQ071MON_AVAILABLE             1
#define FM4_INTREQ_IRQ072MON_AVAILABLE            1
#define FM_INTREQ_IRQ072MON_AVAILABLE             1
#define FM4_INTREQ_IRQ073MON_AVAILABLE            1
#define FM_INTREQ_IRQ073MON_AVAILABLE             1
#define FM4_INTREQ_IRQ074MON_AVAILABLE            1
#define FM_INTREQ_IRQ074MON_AVAILABLE             1
#define FM4_INTREQ_IRQ075MON_AVAILABLE            1
#define FM_INTREQ_IRQ075MON_AVAILABLE             1
#define FM4_INTREQ_IRQ076MON_AVAILABLE            1
#define FM_INTREQ_IRQ076MON_AVAILABLE             1
#define FM4_INTREQ_IRQ077MON_AVAILABLE            1
#define FM_INTREQ_IRQ077MON_AVAILABLE             1
#define FM4_INTREQ_IRQ078MON_AVAILABLE            1
#define FM_INTREQ_IRQ078MON_AVAILABLE             1
#define FM4_INTREQ_IRQ079MON_AVAILABLE            1
#define FM_INTREQ_IRQ079MON_AVAILABLE             1
#define FM4_INTREQ_IRQ080MON_AVAILABLE            1
#define FM_INTREQ_IRQ080MON_AVAILABLE             1
#define FM4_INTREQ_IRQ081MON_AVAILABLE            1
#define FM_INTREQ_IRQ081MON_AVAILABLE             1
#define FM4_INTREQ_IRQ082MON_AVAILABLE            1
#define FM_INTREQ_IRQ082MON_AVAILABLE             1
#define FM4_INTREQ_IRQ083MON_AVAILABLE            1
#define FM_INTREQ_IRQ083MON_AVAILABLE             1
#define FM4_INTREQ_IRQ084MON_AVAILABLE            1
#define FM_INTREQ_IRQ084MON_AVAILABLE             1
#define FM4_INTREQ_IRQ085MON_AVAILABLE            1
#define FM_INTREQ_IRQ085MON_AVAILABLE             1
#define FM4_INTREQ_IRQ086MON_AVAILABLE            1
#define FM_INTREQ_IRQ086MON_AVAILABLE             1
#define FM4_INTREQ_IRQ087MON_AVAILABLE            1
#define FM_INTREQ_IRQ087MON_AVAILABLE             1
#define FM4_INTREQ_IRQ088MON_AVAILABLE            1
#define FM_INTREQ_IRQ088MON_AVAILABLE             1
#define FM4_INTREQ_IRQ089MON_AVAILABLE            1
#define FM_INTREQ_IRQ089MON_AVAILABLE             1
#define FM4_INTREQ_IRQ090MON_AVAILABLE            1
#define FM_INTREQ_IRQ090MON_AVAILABLE             1
#define FM4_INTREQ_IRQ091MON_AVAILABLE            1
#define FM_INTREQ_IRQ091MON_AVAILABLE             1
#define FM4_INTREQ_IRQ092MON_AVAILABLE            1
#define FM_INTREQ_IRQ092MON_AVAILABLE             1
#define FM4_INTREQ_IRQ093MON_AVAILABLE            1
#define FM_INTREQ_IRQ093MON_AVAILABLE             1
#define FM4_INTREQ_IRQ094MON_AVAILABLE            1
#define FM_INTREQ_IRQ094MON_AVAILABLE             1
#define FM4_INTREQ_IRQ095MON_AVAILABLE            1
#define FM_INTREQ_IRQ095MON_AVAILABLE             1
#define FM4_INTREQ_IRQ096MON_AVAILABLE            1
#define FM_INTREQ_IRQ096MON_AVAILABLE             1
#define FM4_INTREQ_IRQ097MON_AVAILABLE            1
#define FM_INTREQ_IRQ097MON_AVAILABLE             1
#define FM4_INTREQ_IRQ098MON_AVAILABLE            1
#define FM_INTREQ_IRQ098MON_AVAILABLE             1
#define FM4_INTREQ_IRQ099MON_AVAILABLE            1
#define FM_INTREQ_IRQ099MON_AVAILABLE             1
#define FM4_INTREQ_IRQ100MON_AVAILABLE            1
#define FM_INTREQ_IRQ100MON_AVAILABLE             1
#define FM4_INTREQ_IRQ101MON_AVAILABLE            1
#define FM_INTREQ_IRQ101MON_AVAILABLE             1
#define FM4_INTREQ_IRQ102MON_AVAILABLE            1
#define FM_INTREQ_IRQ102MON_AVAILABLE             1
#define FM4_INTREQ_IRQ103MON_AVAILABLE            1
#define FM_INTREQ_IRQ103MON_AVAILABLE             1
#define FM4_INTREQ_IRQ104MON_AVAILABLE            1
#define FM_INTREQ_IRQ104MON_AVAILABLE             1
#define FM4_INTREQ_IRQ105MON_AVAILABLE            1
#define FM_INTREQ_IRQ105MON_AVAILABLE             1
#define FM4_INTREQ_IRQ106MON_AVAILABLE            1
#define FM_INTREQ_IRQ106MON_AVAILABLE             1
#define FM4_INTREQ_IRQ107MON_AVAILABLE            1
#define FM_INTREQ_IRQ107MON_AVAILABLE             1
#define FM4_INTREQ_IRQ108MON_AVAILABLE            1
#define FM_INTREQ_IRQ108MON_AVAILABLE             1
#define FM4_INTREQ_IRQ109MON_AVAILABLE            1
#define FM_INTREQ_IRQ109MON_AVAILABLE             1
#define FM4_INTREQ_IRQ110MON_AVAILABLE            1
#define FM_INTREQ_IRQ110MON_AVAILABLE             1
#define FM4_INTREQ_IRQ111MON_AVAILABLE            1
#define FM_INTREQ_IRQ111MON_AVAILABLE             1
#define FM4_INTREQ_IRQ112MON_AVAILABLE            1
#define FM_INTREQ_IRQ112MON_AVAILABLE             1
#define FM4_INTREQ_IRQ113MON_AVAILABLE            1
#define FM_INTREQ_IRQ113MON_AVAILABLE             1
#define FM4_INTREQ_IRQ114MON_AVAILABLE            1
#define FM_INTREQ_IRQ114MON_AVAILABLE             1
#define FM4_INTREQ_IRQ115MON_AVAILABLE            1
#define FM_INTREQ_IRQ115MON_AVAILABLE             1
#define FM4_INTREQ_IRQ116MON_AVAILABLE            1
#define FM_INTREQ_IRQ116MON_AVAILABLE             1
#define FM4_INTREQ_IRQ117MON_AVAILABLE            1
#define FM_INTREQ_IRQ117MON_AVAILABLE             1
#define FM4_INTREQ_IRQ118MON_AVAILABLE            1
#define FM_INTREQ_IRQ118MON_AVAILABLE             1
#define FM4_INTREQ_IRQ119MON_AVAILABLE            1
#define FM_INTREQ_IRQ119MON_AVAILABLE             1
#define FM4_INTREQ_IRQ120MON_AVAILABLE            1
#define FM_INTREQ_IRQ120MON_AVAILABLE             1
#define FM4_INTREQ_IRQ121MON_AVAILABLE            1
#define FM_INTREQ_IRQ121MON_AVAILABLE             1
#define FM4_INTREQ_IRQ122MON_AVAILABLE            1
#define FM_INTREQ_IRQ122MON_AVAILABLE             1
#define FM4_INTREQ_IRQ123MON_AVAILABLE            1
#define FM_INTREQ_IRQ123MON_AVAILABLE             1
#define FM4_INTREQ_IRQ124MON_AVAILABLE            1
#define FM_INTREQ_IRQ124MON_AVAILABLE             1
#define FM4_INTREQ_IRQ125MON_AVAILABLE            1
#define FM_INTREQ_IRQ125MON_AVAILABLE             1
#define FM4_INTREQ_IRQ126MON_AVAILABLE            1
#define FM_INTREQ_IRQ126MON_AVAILABLE             1
#define FM4_INTREQ_IRQ127MON_AVAILABLE            1
#define FM_INTREQ_IRQ127MON_AVAILABLE             1
#define FM4_INTREQ_ODDPKS_AVAILABLE               1
#define FM_INTREQ_ODDPKS_AVAILABLE                1
/*******************************************************************************
* LSCRP
*******************************************************************************/
#define FM4_LSCRP_LCR_PRSLD_AVAILABLE             1
#define FM_LSCRP_LCR_PRSLD_AVAILABLE              1
/*******************************************************************************
* LVD
*******************************************************************************/
#define FM4_LVD_LVD_CLR_AVAILABLE                 1
#define FM_LVD_LVD_CLR_AVAILABLE                  1
#define FM4_LVD_LVD_CTL_AVAILABLE                 1
#define FM_LVD_LVD_CTL_AVAILABLE                  1
#define FM4_LVD_LVD_RLR_AVAILABLE                 1
#define FM_LVD_LVD_RLR_AVAILABLE                  1
#define FM4_LVD_LVD_STR_AVAILABLE                 1
#define FM_LVD_LVD_STR_AVAILABLE                  1
#define FM4_LVD_LVD_STR2_AVAILABLE                1
#define FM_LVD_LVD_STR2_AVAILABLE                 1
/*******************************************************************************
* MFS0
*******************************************************************************/
#define FM4_MFS_CSIO_BGR_AVAILABLE                1
#define FM_MFS_CSIO_BGR_AVAILABLE                 1
#define FM4_MFS_CSIO_ESCR_AVAILABLE               1
#define FM_MFS_CSIO_ESCR_AVAILABLE                1
#define FM4_MFS_CSIO_FBYTE1_AVAILABLE             1
#define FM_MFS_CSIO_FBYTE1_AVAILABLE              1
#define FM4_MFS_CSIO_FBYTE2_AVAILABLE             1
#define FM_MFS_CSIO_FBYTE2_AVAILABLE              1
#define FM4_MFS_CSIO_FCR_AVAILABLE                1
#define FM_MFS_CSIO_FCR_AVAILABLE                 1
#define FM4_MFS_CSIO_RDR_AVAILABLE                1
#define FM_MFS_CSIO_RDR_AVAILABLE                 1
#define FM4_MFS_CSIO_SACSR_AVAILABLE              1
#define FM_MFS_CSIO_SACSR_AVAILABLE               1
#define FM4_MFS_CSIO_SCR_AVAILABLE                1
#define FM_MFS_CSIO_SCR_AVAILABLE                 1
#define FM4_MFS_CSIO_SCSCR_AVAILABLE              1
#define FM_MFS_CSIO_SCSCR_AVAILABLE               1
#define FM4_MFS_CSIO_SCSTR0_AVAILABLE             1
#define FM_MFS_CSIO_SCSTR0_AVAILABLE              1
#define FM4_MFS_CSIO_SCSTR1_AVAILABLE             1
#define FM_MFS_CSIO_SCSTR1_AVAILABLE              1
#define FM4_MFS_CSIO_SCSTR32_AVAILABLE            1
#define FM_MFS_CSIO_SCSTR32_AVAILABLE             1
#define FM4_MFS_CSIO_SMR_AVAILABLE                1
#define FM_MFS_CSIO_SMR_AVAILABLE                 1
#define FM4_MFS_CSIO_SSR_AVAILABLE                1
#define FM_MFS_CSIO_SSR_AVAILABLE                 1
#define FM4_MFS_CSIO_STMCR_AVAILABLE              1
#define FM_MFS_CSIO_STMCR_AVAILABLE               1
#define FM4_MFS_CSIO_STMR_AVAILABLE               1
#define FM_MFS_CSIO_STMR_AVAILABLE                1
#define FM4_MFS_CSIO_TBYTE0_AVAILABLE             1
#define FM_MFS_CSIO_TBYTE0_AVAILABLE              1
#define FM4_MFS_CSIO_TDR_AVAILABLE                1
#define FM_MFS_CSIO_TDR_AVAILABLE                 1
#define FM4_MFS_I2C_BGR_AVAILABLE                 1
#define FM_MFS_I2C_BGR_AVAILABLE                  1
#define FM4_MFS_I2C_EIBCR_AVAILABLE               1
#define FM_MFS_I2C_EIBCR_AVAILABLE                1
#define FM4_MFS_I2C_FBYTE1_AVAILABLE              1
#define FM_MFS_I2C_FBYTE1_AVAILABLE               1
#define FM4_MFS_I2C_FBYTE2_AVAILABLE              1
#define FM_MFS_I2C_FBYTE2_AVAILABLE               1
#define FM4_MFS_I2C_FCR_AVAILABLE                 1
#define FM_MFS_I2C_FCR_AVAILABLE                  1
#define FM4_MFS_I2C_IBCR_AVAILABLE                1
#define FM_MFS_I2C_IBCR_AVAILABLE                 1
#define FM4_MFS_I2C_IBSR_AVAILABLE                1
#define FM_MFS_I2C_IBSR_AVAILABLE                 1
#define FM4_MFS_I2C_ISBA_AVAILABLE                1
#define FM_MFS_I2C_ISBA_AVAILABLE                 1
#define FM4_MFS_I2C_ISMK_AVAILABLE                1
#define FM_MFS_I2C_ISMK_AVAILABLE                 1
#define FM4_MFS_I2C_NFCR_AVAILABLE                1
#define FM_MFS_I2C_NFCR_AVAILABLE                 1
#define FM4_MFS_I2C_RDR_AVAILABLE                 1
#define FM_MFS_I2C_RDR_AVAILABLE                  1
#define FM4_MFS_I2C_SMR_AVAILABLE                 1
#define FM_MFS_I2C_SMR_AVAILABLE                  1
#define FM4_MFS_I2C_SSR_AVAILABLE                 1
#define FM_MFS_I2C_SSR_AVAILABLE                  1
#define FM4_MFS_I2C_TDR_AVAILABLE                 1
#define FM_MFS_I2C_TDR_AVAILABLE                  1
#define FM4_MFS_LIN_BGR_AVAILABLE                 1
#define FM_MFS_LIN_BGR_AVAILABLE                  1
#define FM4_MFS_LIN_ESCR_AVAILABLE                1
#define FM_MFS_LIN_ESCR_AVAILABLE                 1
#define FM4_MFS_LIN_FBYTE1_AVAILABLE              1
#define FM_MFS_LIN_FBYTE1_AVAILABLE               1
#define FM4_MFS_LIN_FBYTE2_AVAILABLE              1
#define FM_MFS_LIN_FBYTE2_AVAILABLE               1
#define FM4_MFS_LIN_FCR_AVAILABLE                 1
#define FM_MFS_LIN_FCR_AVAILABLE                  1
#define FM4_MFS_LIN_RDR_AVAILABLE                 1
#define FM_MFS_LIN_RDR_AVAILABLE                  1
#define FM4_MFS_LIN_SCR_AVAILABLE                 1
#define FM_MFS_LIN_SCR_AVAILABLE                  1
#define FM4_MFS_LIN_SMR_AVAILABLE                 1
#define FM_MFS_LIN_SMR_AVAILABLE                  1
#define FM4_MFS_LIN_SSR_AVAILABLE                 1
#define FM_MFS_LIN_SSR_AVAILABLE                  1
#define FM4_MFS_LIN_TDR_AVAILABLE                 1
#define FM_MFS_LIN_TDR_AVAILABLE                  1
#define FM4_MFS_UART_BGR_AVAILABLE                1
#define FM_MFS_UART_BGR_AVAILABLE                 1
#define FM4_MFS_UART_ESCR_AVAILABLE               1
#define FM_MFS_UART_ESCR_AVAILABLE                1
#define FM4_MFS_UART_FBYTE1_AVAILABLE             1
#define FM_MFS_UART_FBYTE1_AVAILABLE              1
#define FM4_MFS_UART_FBYTE2_AVAILABLE             1
#define FM_MFS_UART_FBYTE2_AVAILABLE              1
#define FM4_MFS_UART_FCR_AVAILABLE                1
#define FM_MFS_UART_FCR_AVAILABLE                 1
#define FM4_MFS_UART_RDR_AVAILABLE                1
#define FM_MFS_UART_RDR_AVAILABLE                 1
#define FM4_MFS_UART_SCR_AVAILABLE                1
#define FM_MFS_UART_SCR_AVAILABLE                 1
#define FM4_MFS_UART_SMR_AVAILABLE                1
#define FM_MFS_UART_SMR_AVAILABLE                 1
#define FM4_MFS_UART_SSR_AVAILABLE                1
#define FM_MFS_UART_SSR_AVAILABLE                 1
#define FM4_MFS_UART_TDR_AVAILABLE                1
#define FM_MFS_UART_TDR_AVAILABLE                 1
/*******************************************************************************
* MFT0
*******************************************************************************/
#define FM4_MFT_ADCMP_ACFS10_AVAILABLE            1
#define FM_MFT_ADCMP_ACFS10_AVAILABLE             1
#define FM4_MFT_ADCMP_ACFS32_AVAILABLE            1
#define FM_MFT_ADCMP_ACFS32_AVAILABLE             1
#define FM4_MFT_ADCMP_ACFS54_AVAILABLE            1
#define FM_MFT_ADCMP_ACFS54_AVAILABLE             1
#define FM4_MFT_ADCMP_ACMP0_AVAILABLE             1
#define FM_MFT_ADCMP_ACMP0_AVAILABLE              1
#define FM4_MFT_ADCMP_ACMP1_AVAILABLE             1
#define FM_MFT_ADCMP_ACMP1_AVAILABLE              1
#define FM4_MFT_ADCMP_ACMP2_AVAILABLE             1
#define FM_MFT_ADCMP_ACMP2_AVAILABLE              1
#define FM4_MFT_ADCMP_ACMP3_AVAILABLE             1
#define FM_MFT_ADCMP_ACMP3_AVAILABLE              1
#define FM4_MFT_ADCMP_ACMP4_AVAILABLE             1
#define FM_MFT_ADCMP_ACMP4_AVAILABLE              1
#define FM4_MFT_ADCMP_ACMP5_AVAILABLE             1
#define FM_MFT_ADCMP_ACMP5_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSA_AVAILABLE              1
#define FM_MFT_ADCMP_ACSA_AVAILABLE               1
#define FM4_MFT_ADCMP_ACSC0_AVAILABLE             1
#define FM_MFT_ADCMP_ACSC0_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSC1_AVAILABLE             1
#define FM_MFT_ADCMP_ACSC1_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSC2_AVAILABLE             1
#define FM_MFT_ADCMP_ACSC2_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSC3_AVAILABLE             1
#define FM_MFT_ADCMP_ACSC3_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSC4_AVAILABLE             1
#define FM_MFT_ADCMP_ACSC4_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSC5_AVAILABLE             1
#define FM_MFT_ADCMP_ACSC5_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSD0_AVAILABLE             1
#define FM_MFT_ADCMP_ACSD0_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSD1_AVAILABLE             1
#define FM_MFT_ADCMP_ACSD1_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSD2_AVAILABLE             1
#define FM_MFT_ADCMP_ACSD2_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSD3_AVAILABLE             1
#define FM_MFT_ADCMP_ACSD3_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSD4_AVAILABLE             1
#define FM_MFT_ADCMP_ACSD4_AVAILABLE              1
#define FM4_MFT_ADCMP_ACSD5_AVAILABLE             1
#define FM_MFT_ADCMP_ACSD5_AVAILABLE              1
#define FM4_MFT_FRT_TCAL_AVAILABLE                1
#define FM_MFT_FRT_TCAL_AVAILABLE                 1
#define FM4_MFT_FRT_TCCP0_AVAILABLE               1
#define FM_MFT_FRT_TCCP0_AVAILABLE                1
#define FM4_MFT_FRT_TCCP1_AVAILABLE               1
#define FM_MFT_FRT_TCCP1_AVAILABLE                1
#define FM4_MFT_FRT_TCCP2_AVAILABLE               1
#define FM_MFT_FRT_TCCP2_AVAILABLE                1
#define FM4_MFT_FRT_TCDT0_AVAILABLE               1
#define FM_MFT_FRT_TCDT0_AVAILABLE                1
#define FM4_MFT_FRT_TCDT1_AVAILABLE               1
#define FM_MFT_FRT_TCDT1_AVAILABLE                1
#define FM4_MFT_FRT_TCDT2_AVAILABLE               1
#define FM_MFT_FRT_TCDT2_AVAILABLE                1
#define FM4_MFT_FRT_TCSA0_AVAILABLE               1
#define FM_MFT_FRT_TCSA0_AVAILABLE                1
#define FM4_MFT_FRT_TCSA1_AVAILABLE               1
#define FM_MFT_FRT_TCSA1_AVAILABLE                1
#define FM4_MFT_FRT_TCSA2_AVAILABLE               1
#define FM_MFT_FRT_TCSA2_AVAILABLE                1
#define FM4_MFT_FRT_TCSC0_AVAILABLE               1
#define FM_MFT_FRT_TCSC0_AVAILABLE                1
#define FM4_MFT_FRT_TCSC1_AVAILABLE               1
#define FM_MFT_FRT_TCSC1_AVAILABLE                1
#define FM4_MFT_FRT_TCSC2_AVAILABLE               1
#define FM_MFT_FRT_TCSC2_AVAILABLE                1
#define FM4_MFT_ICU_ICCP0_AVAILABLE               1
#define FM_MFT_ICU_ICCP0_AVAILABLE                1
#define FM4_MFT_ICU_ICCP1_AVAILABLE               1
#define FM_MFT_ICU_ICCP1_AVAILABLE                1
#define FM4_MFT_ICU_ICCP2_AVAILABLE               1
#define FM_MFT_ICU_ICCP2_AVAILABLE                1
#define FM4_MFT_ICU_ICCP3_AVAILABLE               1
#define FM_MFT_ICU_ICCP3_AVAILABLE                1
#define FM4_MFT_ICU_ICFS10_AVAILABLE              1
#define FM_MFT_ICU_ICFS10_AVAILABLE               1
#define FM4_MFT_ICU_ICFS32_AVAILABLE              1
#define FM_MFT_ICU_ICFS32_AVAILABLE               1
#define FM4_MFT_ICU_ICSA10_AVAILABLE              1
#define FM_MFT_ICU_ICSA10_AVAILABLE               1
#define FM4_MFT_ICU_ICSA32_AVAILABLE              1
#define FM_MFT_ICU_ICSA32_AVAILABLE               1
#define FM4_MFT_ICU_ICSB10_AVAILABLE              1
#define FM_MFT_ICU_ICSB10_AVAILABLE               1
#define FM4_MFT_ICU_ICSB32_AVAILABLE              1
#define FM_MFT_ICU_ICSB32_AVAILABLE               1
#define FM4_MFT_OCU_OCCP0_AVAILABLE               1
#define FM_MFT_OCU_OCCP0_AVAILABLE                1
#define FM4_MFT_OCU_OCCP1_AVAILABLE               1
#define FM_MFT_OCU_OCCP1_AVAILABLE                1
#define FM4_MFT_OCU_OCCP2_AVAILABLE               1
#define FM_MFT_OCU_OCCP2_AVAILABLE                1
#define FM4_MFT_OCU_OCCP3_AVAILABLE               1
#define FM_MFT_OCU_OCCP3_AVAILABLE                1
#define FM4_MFT_OCU_OCCP4_AVAILABLE               1
#define FM_MFT_OCU_OCCP4_AVAILABLE                1
#define FM4_MFT_OCU_OCCP5_AVAILABLE               1
#define FM_MFT_OCU_OCCP5_AVAILABLE                1
#define FM4_MFT_OCU_OCFS10_AVAILABLE              1
#define FM_MFT_OCU_OCFS10_AVAILABLE               1
#define FM4_MFT_OCU_OCFS32_AVAILABLE              1
#define FM_MFT_OCU_OCFS32_AVAILABLE               1
#define FM4_MFT_OCU_OCFS54_AVAILABLE              1
#define FM_MFT_OCU_OCFS54_AVAILABLE               1
